app/controllers/search_controller.rb

SELECT  1 AS one FROM "watchlists" WHERE "watchlists"."user_id" = $1 LIMIT $2
SELECT  "watchlists".* FROM "watchlists" WHERE "watchlists"."user_id" = $1 ORDER BY "watchlists"."id" ASC LIMIT $2
---
	def index
		# set search word #
		if params[:searchword]
			security_name = params[:searchword]
			# for autorefresh #
			respond_to do |format|
		      format.html
		      format.js
		    end
		# display the users last watchlist item #
		elsif user_signed_in? && current_user.watchlists.any?