app/controllers/watchlist_controller.rb

INSERT INTO "watchlists" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @watchlist = Watchlist.new(watchlist_params)
    respond_to do |format|
      if current_user
        if @watchlist.save